app/Modules/Profil/Controllers/Profil.php

SELECT *
FROM `negotiations`
WHERE `buyer_id` IS NULL
OR `seller_id` IS NULL
ORDER BY `created_at` DESC
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
   public function index()
{
    $session = session();

    $negotiationModel = new NegotiationModel();

    $userId = $session->get('id');

    $negotiations = $negotiationModel
        ->where('buyer_id', $userId)
        ->orWhere('seller_id', $userId)
        ->orderBy('created_at', 'DESC')
        ->findAll();

    $data['user'] = [
        'nama'  => $session->get('nama'),
        'email' => $session->get('email'),
        'role'  => $session->get('role'),
        'nik'   => $session->get('nik')
    ];