app/Modules/Berita/Controllers/Berita.php

SELECT *
FROM `berita`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function index()
    {
        $berita = $this->beritaModel
            ->orderBy('created_at', 'DESC')
            ->findAll(5);

SELECT *
FROM `berita`
WHERE `slug` = 'permintaan-kapal-bulk-carier-meningkat'
 LIMIT 1
---
    public function detail($slug)
{
    $beritaModel = new \App\Modules\Berita\Models\BeritaModel();

    $berita = $beritaModel
        ->where('slug', $slug)
        ->first();