app/Modules/Katalog/Controllers/Katalog.php

    public function detail($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('auth/login'))->with('error', 'Silakan login terlebih dahulu untuk melihat detail dan menawar kapal.');
        }

        $kapal = $this->bulkCarrierModel->find($id);

        if (!$kapal) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Data kapal tidak ditemukan");
        }

        $buyer_id = session()->get('user_data')['id'] ?? session()->get('id');
        $db = \Config\Database::connect();
        $cek_nego = $db->table('negotiations')->where('ship_id', $id)->where('buyer_id', $buyer_id)->get()->getRowArray();
---
SELECT *
FROM `bulk_carriers`
WHERE `bulk_carriers`.`id` = '1'
SELECT *
FROM `negotiations`
WHERE `ship_id` = '1'
AND `buyer_id` = '2'