app/Modules/Produk/Controllers/Produk.php

SELECT *
FROM `bulk_carriers`
WHERE `bulk_carriers`.`id` = '6'
---
    public function detail($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('auth/login'))->with('error', 'Silakan login terlebih dahulu untuk melihat detail dan menawar kapal.');
        }

        // Asumsi detail ini mengambil dari bulkCarrier (perlu disesuaikan jika id dari tipe lain)
        $kapal = $this->bulkCarrierModel->find($id);