app/Modules/Beranda/Controllers/Beranda.php

    public function index()
    {
        $bulkCarrierModel = new BulkCarrierModel();
        $tugboatModel = new TugboatModel();
        $passengerShipModel = new PassengerShipModel(); // Inisiasi Model

        $data = [
            'kapal_bulk'      => $bulkCarrierModel->where('status', 'available')->findAll(),
            'kapal_tugboat'   => $tugboatModel->findAll(), // Tambahkan where('status', 'available') jika di DB Tugboat nanti kamu tambahkan kolom status
            'kapal_passenger' => $passengerShipModel->where('status', 'available')->findAll() // Panggil datanya
---
SELECT *
FROM `tugboats`
SELECT *
FROM `passenger_ships`
WHERE `status` = 'available'