app/Modules/Beranda/Controllers/Beranda.php

SELECT *
FROM `bulk_carriers`
WHERE `status` = 'available'
---
    public function index()
    {
        $bulkCarrierModel = new BulkCarrierModel();

        // Gunakan variabel array lokal biasa, BUKAN $this->data
        $data = [
            'kapal_bulk' => $bulkCarrierModel->where('status', 'available')->findAll()
        ];